Revit 2027 API
BuiltInFailures.InfillFailures.InPlaceFamilyNotCuttingHost Property
 Instance of in-place family is not cutting host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InPlaceFamilyNotCuttingHost { get; }
Public Shared ReadOnly Property InPlaceFamilyNotCuttingHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InPlaceFamilyNotCuttingHost {
	FailureDefinitionId^ get ();
}
static member InPlaceFamilyNotCuttingHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace